app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["first_name", "NIcolas"], ["created_at", "2022-03-26 13:22:07.625621"], ["updated_at", "2022-03-26 13:22:07.625621"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users"."first_name" FROM "users" WHERE "users"."first_name" = ?  [["first_name", "li"]]
---
    def search_name_p(name)
      User.where("first_name like ?", "#{name}").pluck(:first_name)

SELECT "users"."first_name" FROM "users" WHERE (first_name like '%liu%')
---
    def search_name(name)
      User.where("first_name like ?", "%#{name}%").pluck(:first_name)